/*+----------------------------------------------------------------+
  |	Title:		BmpPal.hpp [共通環境]
  |	Comment:	BMPパレット（※バッファ保持クラス）
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __BMP_PAL_HPP__
#define __BMP_PAL_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

#include "draw/tex/Tex.hpp"
#include "draw/bmp/pal/BmpPalData.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// BMPテクスチャ
//----------------------------------------
class CBmpPal{
protected:
    CTex m_oTexForPal;          // パレットテクスチャ
    CBmpPalData m_oPalData;     // パレットデータ

public:
    // コンストラクタ／デストラクタ
    CBmpPal( void );
    virtual ~CBmpPal( void );
    
    // クリア／開放
    void clear( void );
    void release( void );

    // 取得
    inline CTex* getTexForPal( void ){ return( &m_oTexForPal ); }
    inline CBmpPalData* getPalData( void ){ return( &m_oPalData ); }

    // パレットの読み込み
    inline bool loadToTex( void ){ return( m_oPalData.loadToTex( &m_oTexForPal ) ); }
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	// __BMP_PAL_HPP__
