/*+----------------------------------------------------------------+
  |	Title:		FontCheckLoop.hpp [共通環境]
  |	Comment:	フォント確認ループ
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __FONT_CHECK_LOOP_HPP__
#define __FONT_CHECK_LOOP_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

#include "loop/GestureLoop.hpp"
#include "loop/node/Button.hpp"
#include "loop/node/StrMenu.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------------------
// フォント確認ループ
//----------------------------------------
class CFontCheckLoop: public CGestureLoop{
protected:
	CButton*	m_pButtonExit;
	CButton*	m_pButtonBack;
	CStrMenu*	m_pMenuCategory;
	CStrMenu*	m_pMenuTarget;

public:
	CFontCheckLoop( void );
	virtual ~CFontCheckLoop( void );

protected:
	virtual void init0( void );
	virtual void exit0( void );
	virtual void update0( void );
	virtual void onDraw0( void );
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
#endif	/* __FONT_CHECK_LOOP_HPP__ */
