/*+----------------------------------------------------------------+
  |	Title:		BPConst.hpp [共通環境]
  |	Comment:	BmpPal定数関連
  |             [bmp2hif.exe/img2hif.exe]の実装に依存
  |	Author:		K.Takayanagi
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Header Define	ヘッダ定義
  +----------------------------------------------------------------+*/
#ifndef __BP_CONST_HPP__
#define __BP_CONST_HPP__

/*+----------------------------------------------------------------+
  |	Include		インクルードヘッダ
  +----------------------------------------------------------------+*/
#include "env.hpp"

#include "draw/bmp/dot/BDConst.hpp"

/*+----------------------------------------------------------------+
  |	Define		デファイン定義
  +----------------------------------------------------------------+*/
//-----------------------------------------------------------------
// 区分（※データの種別）
//-----------------------------------------------------------------
enum eBP_CATEGORY{
    eBP_CATEGORY_INVALID = -1,
    
    eBP_CATEGORY_ARITH,     // アリス（キャラクタ）
    eBP_CATEGORY_SUIT,      // スーツ（着ぐるみ）
    eBP_CATEGORY_OPTION,    // オプション（付属物）
    
    eBP_CATEGORY_MAX,
};

#define IS_BP_CATEGORY_VALID( _c )  ((_c)>=(eBP_CATEGORY)0 && (_c)<eBP_CATEGORY_MAX)

//------------------------------------------------------------------------
// UID／サブID
//------------------------------------------------------------------------
// ・列挙子ではなく数値を割り当てて管理するもの
// ・[UID]によりカテゴリ別に[BPD]を特定する
// ・[サブID]は[BPD]内で差分を持つ際に利用する（※同じ画素に対するカラーバリエーション）
//------------------------------------------------------------------------
// [UID]の管理は[BDConst]と同様、確保枠と運用上の値域が異なる想定であることに注意
//------------------------------------------------------------------------
// 00000000 〜 99999999
#define BP_UID_INVALID                  BD_UID_INVALID
#define BP_UID_MIN                      BD_UID_MIN
#define BP_UID_MAX                      BD_UID_MAX
#define IS_BP_UID_VALID                 IS_BD_UID_VALID

// 00 〜 99
#define BP_SUB_ID_INVALID               BD_SUB_ID_INVALID
#define BP_SUB_ID_MIN                   BD_SUB_ID_MIN
#define BP_SUB_ID_MAX                   BD_SUB_ID_MAX
#define IS_BP_SUB_ID_VALID              IS_BD_SUB_ID_VALID

/*+----------------------------------------------------------------+
  |	Struct		構造体型宣言
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Class		クラス定義
  +----------------------------------------------------------------+*/
//----------------------------
// Bmpパレット定数
//----------------------------
class CBPConst{
public:
    // BPD識別名の設定
    static void SetBmpPalDataName( char* pBuf, eBP_CATEGORY category, int uid, int subId );
    
private:
	// インスタンス生成は不可
	CBPConst( void ){}
	virtual ~CBPConst( void ){}
};

/*+----------------------------------------------------------------+
  |	Global		グローバルデータ型定義
  +----------------------------------------------------------------+*/
/*+----------------------------------------------------------------+
  |	Prototype	プロトタイプ宣言
  +----------------------------------------------------------------+*/
extern const char* g_pArrLabelBpCategory[];
extern const char* g_pArrLabelBpCategoryS[];

#endif /* __BP_CONST_HPP__ */
